Revit 2027 API
LabelUtils.GetStructuralSectionShapeName Method
 Gets the user-visible name for a StructuralSectionShape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetStructuralSectionShapeName(
	StructuralSectionShape shape
)
Public Shared Function GetStructuralSectionShapeName (
	shape As StructuralSectionShape
) As String
public:
static String^ GetStructuralSectionShapeName(
	StructuralSectionShape shape
)
static member GetStructuralSectionShapeName :
        shape : StructuralSectionShape -> string
Parameters
shape StructuralSectionShape
 The StructuralSectionShape to get the user-visible name.
Return Value
String
 Returns the user-visible name for the StructuralSectionShape.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 The name is obtained in the current Revit language.
See Also
Reference
LabelUtils Class
Autodesk.Revit.DB Namespace